app/controllers/api/articles_controller.rb

SELECT `articles`.* FROM `articles`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3, 2)
---
  def index
    @articles = Article.includes(:user).all