app/controllers/api/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'carl@mail.ru' ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'xam@mail.ru' LIMIT 1
---
  def create
    Rails.logger.info "Starting session creation process for user authentication"

    if current_user
      Rails.logger.warn "User already authenticated. Current user ID: #{current_user.id}. Requesting new session creation."
      render json: { error: 'Вы уже вошли в систему' }, status: :unprocessable_entity
      return
    end

    email = params.dig(:user, :email)&.strip
    password = params.dig(:user, :password)&.strip

    if email.blank? || password.blank?
      Rails.logger.error "Missing email or password in request. Params: #{params.inspect}. Authentication failed."
      render json: { error: 'Email и пароль обязательны' }, status: :unprocessable_entity
      return
    end

    Rails.logger.info "Attempting to authenticate user with email: #{email}"
    user = User.find_by(email: email)