app/controllers/api/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def show
    Rails.logger.debug("Params ID for user lookup: #{params[:id]}")
    @user = User.find_by(id: params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2025-07-20 03:41:59.451082', `users`.`nickname` = 'bombardiro crocodilo', `users`.`description` = '' WHERE `users`.`id` = 3
---
  def update
    @user = User.find(params[:id])
    if params[:user][:photo].present?
      @user.photo.attach(params[:user][:photo])
    end
    if @user.update(user_params)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2025-07-20 02:49:52.323337' WHERE `users`.`id` = 3
---
  def update_photo
    @user = User.find(params[:id])
    Rails.logger.debug("Received parameters: #{params.inspect}")

    # Permit the photo parameter
    permitted_params = params.require(:user).permit(:photo)

    if permitted_params[:photo].present?
      @user.photo.attach(permitted_params[:photo])
      Rails.logger.debug("Photo attached: #{@user.photo.attached?}")
    else
      render json: { error: "Photo not provided." }, status: :unprocessable_entity and return
    end

    if @user.save

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all
    users_with_photos = @users.map do |user|

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def following_status
    user = User.find(params[:user_id])